grevaillot/svd_tools/headers/STM32H750x/gpioh.h
#define GPIOH_GPIO_PUPDR_PUPD3_SHIFT		6
#define GPIOH_GPIO_PUPDR_PUPD3_MASK		0x03
/** @defgroup gpioh_gpio_pupdr_pupd3 PUPD3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOH_GPIO_PUPDR_PUPD2_SHIFT		4
#define GPIOH_GPIO_PUPDR_PUPD2_MASK		0x03
/** @defgroup gpioh_gpio_pupdr_pupd2 PUPD2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOH_GPIO_PUPDR_PUPD1_SHIFT		2
#define GPIOH_GPIO_PUPDR_PUPD1_MASK		0x03
/** @defgroup gpioh_gpio_pupdr_pupd1 PUPD1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOH_GPIO_PUPDR_PUPD0_SHIFT		0
#define GPIOH_GPIO_PUPDR_PUPD0_MASK		0x03
/** @defgroup gpioh_gpio_pupdr_pupd0 PUPD0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioh_gpio_idr GPIOIDR GPIO port input data register
@{*/

/** GPIOH_GPIO_IDR_ID15 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID15		(1 << 15)
/** GPIOH_GPIO_IDR_ID14 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID14		(1 << 14)
/** GPIOH_GPIO_IDR_ID13 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID13		(1 << 13)
/** GPIOH_GPIO_IDR_ID12 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID12		(1 << 12)
/** GPIOH_GPIO_IDR_ID11 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID11		(1 << 11)
/** GPIOH_GPIO_IDR_ID10 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID10		(1 << 10)
/** GPIOH_GPIO_IDR_ID9 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID9		(1 << 9)
/** GPIOH_GPIO_IDR_ID8 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID8		(1 << 8)
/** GPIOH_GPIO_IDR_ID7 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID7		(1 << 7)
/** GPIOH_GPIO_IDR_ID6 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID6		(1 << 6)
/** GPIOH_GPIO_IDR_ID5 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID5		(1 << 5)
/** GPIOH_GPIO_IDR_ID4 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID4		(1 << 4)
/** GPIOH_GPIO_IDR_ID3 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID3		(1 << 3)
/** GPIOH_GPIO_IDR_ID2 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID2		(1 << 2)
/** GPIOH_GPIO_IDR_ID1 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID1		(1 << 1)
/** GPIOH_GPIO_IDR_ID0 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOH_GPIO_IDR_ID0		(1 << 0)

/**@}*/

/** @defgroup gpioh_gpio_odr GPIOODR GPIO port output data register
@{*/

/** GPIOH_GPIO_ODR_OD15 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD15		(1 << 15)
/** GPIOH_GPIO_ODR_OD14 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD14		(1 << 14)
/** GPIOH_GPIO_ODR_OD13 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD13		(1 << 13)
/** GPIOH_GPIO_ODR_OD12 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD12		(1 << 12)
/** GPIOH_GPIO_ODR_OD11 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD11		(1 << 11)
/** GPIOH_GPIO_ODR_OD10 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD10		(1 << 10)
/** GPIOH_GPIO_ODR_OD9 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD9		(1 << 9)
/** GPIOH_GPIO_ODR_OD8 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD8		(1 << 8)
/** GPIOH_GPIO_ODR_OD7 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD7		(1 << 7)
/** GPIOH_GPIO_ODR_OD6 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD6		(1 << 6)
/** GPIOH_GPIO_ODR_OD5 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD5		(1 << 5)
/** GPIOH_GPIO_ODR_OD4 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD4		(1 << 4)
/** GPIOH_GPIO_ODR_OD3 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD3		(1 << 3)
/** GPIOH_GPIO_ODR_OD2 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD2		(1 << 2)
/** GPIOH_GPIO_ODR_OD1 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD1		(1 << 1)
/** GPIOH_GPIO_ODR_OD0 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOH_GPIO_ODR_OD0		(1 << 0)

/**@}*/

/** @defgroup gpioh_gpio_bsrr GPIOBSRR GPIO port bit set/reset register
@{*/

/** GPIOH_GPIO_BSRR_BR15 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR15		(1 << 31)
/** GPIOH_GPIO_BSRR_BR14 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR14		(1 << 30)
/** GPIOH_GPIO_BSRR_BR13 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR13		(1 << 29)
/** GPIOH_GPIO_BSRR_BR12 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR12		(1 << 28)
/** GPIOH_GPIO_BSRR_BR11 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR11		(1 << 27)
/** GPIOH_GPIO_BSRR_BR10 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR10		(1 << 26)
/** GPIOH_GPIO_BSRR_BR9 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR9		(1 << 25)
/** GPIOH_GPIO_BSRR_BR8 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR8		(1 << 24)
/** GPIOH_GPIO_BSRR_BR7 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR7		(1 << 23)
/** GPIOH_GPIO_BSRR_BR6 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR6		(1 << 22)
/** GPIOH_GPIO_BSRR_BR5 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR5		(1 << 21)
/** GPIOH_GPIO_BSRR_BR4 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR4		(1 << 20)
/** GPIOH_GPIO_BSRR_BR3 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR3		(1 << 19)
/** GPIOH_GPIO_BSRR_BR2 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR2		(1 << 18)
/** GPIOH_GPIO_BSRR_BR1 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR1		(1 << 17)
/** GPIOH_GPIO_BSRR_BR0 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOH_GPIO_BSRR_BR0		(1 << 16)
/** GPIOH_GPIO_BSRR_BS15 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS15		(1 << 15)
/** GPIOH_GPIO_BSRR_BS14 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS14		(1 << 14)
/** GPIOH_GPIO_BSRR_BS13 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS13		(1 << 13)
/** GPIOH_GPIO_BSRR_BS12 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS12		(1 << 12)
/** GPIOH_GPIO_BSRR_BS11 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS11		(1 << 11)
/** GPIOH_GPIO_BSRR_BS10 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS10		(1 << 10)
/** GPIOH_GPIO_BSRR_BS9 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS9		(1 << 9)
/** GPIOH_GPIO_BSRR_BS8 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS8		(1 << 8)
/** GPIOH_GPIO_BSRR_BS7 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS7		(1 << 7)
/** GPIOH_GPIO_BSRR_BS6 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS6		(1 << 6)
/** GPIOH_GPIO_BSRR_BS5 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS5		(1 << 5)
/** GPIOH_GPIO_BSRR_BS4 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS4		(1 << 4)
/** GPIOH_GPIO_BSRR_BS3 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS3		(1 << 3)
/** GPIOH_GPIO_BSRR_BS2 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS2		(1 << 2)
/** GPIOH_GPIO_BSRR_BS1 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS1		(1 << 1)
/** GPIOH_GPIO_BSRR_BS0 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOH_GPIO_BSRR_BS0		(1 << 0)

/**@}*/

